# Определите, можно ли от шоколадки размером a × b долек отломить c долек,
# если разрешается сделать один разлом по прямой между дольками
# (то есть разломить шоколадку на два прямоугольника).
# Выведите yes или no соответственно.

a = 3
b = 2
c = 4

if c == (a - 1) * b or c == a * (b - 1):
    print("yes")
else:
    print("no")
